app/views/maps/show.html.erb


			var map = L.map('map').setView([42.37, -71.03], 12);
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT 1  [["id", "1"]]