app/views/pops/index.html.erb

SELECT "pops".* FROM "pops"
---

			$.getJSON('fetch', function(data) {
				$.each(data, function(index, value) {

					latlng = index.split(" ");
					add_pop(parseFloat(latlng[0]), parseFloat(latlng[1]), value);
					// L.marker([parseFloat(latlng[0]), parseFloat(latlng[1])], {
					// }).addTo(map).bindPopup("<p contenteditable=\"true\">"+value+"</p><button >Done editing</button><br />")

					//add_note(cell, cellText, value, index);
				});

			});