app/controllers/maps_controller.rb

INSERT INTO "pops" ("comment", "created_at", "lat", "long", "map_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def newtext
    @pop = Pop.new(name:[params[:name]][0], map_id:[params[:mapid]][0])
    @pop.save

SELECT "maps".* FROM "maps"
---
  def index
    @maps = Map.all

SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @map = Map.find(params[:id])

INSERT INTO "maps" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 13 May 2013 04:18:47 UTC +00:00], ["name", "asdf"], ["updated_at", Mon, 13 May 2013 04:18:47 UTC +00:00]]
---
  def create
    @map = Map.new(params[:map])

    respond_to do |format|
      if @map.save