app/controllers/pops_controller.rb

  def index
    @pops = Pop.all
---
SELECT "pops".* FROM "pops"